In [394]:
import pandas as pd
import numpy as np

In [395]:
df00 = pd.read_csv("titles.csv")
df00.head()

,id,title,type,description,release_year,age_certification,runtime,genres,production_countries,seasons,imdb_id,imdb_score,imdb_votes,tmdb_popularity,tmdb_score
0,tm89464,Miracle on 34th Street,MOVIE,"Kris Kringle, seemingly the embodiment of Sant...",1947,G,96,"['family', 'comedy', 'drama']",['US'],NaN,tt0039628,7.9,50969.0,23.515,7.388
1,tm61729,The Adventures of Ichabod and Mr. Toad,MOVIE,The Wind in the Willows: Concise version of Ke...,1950,G,68,"['horror', 'fantasy', 'animation', 'family', '...",['US'],NaN,tt0041094,6.9,16502.0,16.194,6.500
2,tm61052,Cinderella,MOVIE,Cinderella has faith her dreams of a better li...,1950,G,74,"['fantasy', 'animation', 'family', 'romance']",['US'],NaN,tt0042332,7.3,164292.0,93.547,7.035
3,tm87946,Dumbo,MOVIE,Dumbo is a baby elephant born with over-sized ...,1941,G,64,"['animation', 'drama', 'family', 'fantasy']",['US'],NaN,tt0033563,7.2,135045.0,54.265,6.999
4,tm74391,Fantasia,MOVIE,Walt Disney's timeless masterpiece is an extra...,1941,G,119,"['animation', 'family', 'fantasy', 'music']",['US'],NaN,tt0032455,7.7,98764.0,43.609,7.382

In [396]:
df00.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1854 entries, 0 to 1853
Data columns (total 15 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id                    1854 non-null   object
 1   title                 1854 non-null   object
 2   type                  1854 non-null   object
 3   description           1845 non-null   object
 4   release_year          1854 non-null   int64
 5   age_certification     1403 non-null   object
 6   runtime               1854 non-null   int64
 7   genres                1854 non-null   object
 8   production_countries  1854 non-null   object
 9   seasons               540 non-null    float64
 10  imdb_id               1376 non-null   object
 11  imdb_score            1339 non-null   float64
 12  imdb_votes            1328 non-null   float64
 13  tmdb_popularity       1839 non-null   float64
 14  tmdb_score            1708 non-null   float64
dtypes: float64(5), int64(2), object(8)
memory usage: 217.4+ KB

In [397]:
df0 = pd.read_csv("credits.csv")
df0.head()

   person_id       id            name         character   role
0      35549  tm89464  Maureen O'Hara      Doris Walker  ACTOR
1      57832  tm89464      John Payne       Fred Gailey  ACTOR
2      57833  tm89464    Edmund Gwenn      Kris Kringle  ACTOR
3      25096  tm89464    Natalie Wood      Susan Walker  ACTOR
4      27185  tm89464     Porter Hall  Granville Sawyer  ACTOR

In [398]:
df0.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 30689 entries, 0 to 30688
Data columns (total 5 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   person_id  30689 non-null  int64
 1   id         30689 non-null  object
 2   name       30689 non-null  object
 3   character  28794 non-null  object
 4   role       30689 non-null  object
dtypes: int64(1), object(4)
memory usage: 1.2+ MB

In [399]:
#df = pd.concat([df00, df0], axis=1)
#df.head()

In [400]:
df = df00.merge(df0, on="id", how="inner")
df.head()

,id,title,type,description,release_year,age_certification,runtime,genres,production_countries,seasons,imdb_id,imdb_score,imdb_votes,tmdb_popularity,tmdb_score,person_id,name,character,role
0,tm89464,Miracle on 34th Street,MOVIE,"Kris Kringle, seemingly the embodiment of Sant...",1947,G,96,"['family', 'comedy', 'drama']",['US'],NaN,tt0039628,7.9,50969.0,23.515,7.388,35549,Maureen O'Hara,Doris Walker,ACTOR
1,tm89464,Miracle on 34th Street,MOVIE,"Kris Kringle, seemingly the embodiment of Sant...",1947,G,96,"['family', 'comedy', 'drama']",['US'],NaN,tt0039628,7.9,50969.0,23.515,7.388,57832,John Payne,Fred Gailey,ACTOR
2,tm89464,Miracle on 34th Street,MOVIE,"Kris Kringle, seemingly the embodiment of Sant...",1947,G,96,"['family', 'comedy', 'drama']",['US'],NaN,tt0039628,7.9,50969.0,23.515,7.388,57833,Edmund Gwenn,Kris Kringle,ACTOR
3,tm89464,Miracle on 34th Street,MOVIE,"Kris Kringle, seemingly the embodiment of Sant...",1947,G,96,"['family', 'comedy', 'drama']",['US'],NaN,tt0039628,7.9,50969.0,23.515,7.388,25096,Natalie Wood,Susan Walker,ACTOR
4,tm89464,Miracle on 34th Street,MOVIE,"Kris Kringle, seemingly the embodiment of Sant...",1947,G,96,"['family', 'comedy', 'drama']",['US'],NaN,tt0039628,7.9,50969.0,23.515,7.388,27185,Porter Hall,Granville Sawyer,ACTOR

In [401]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 30689 entries, 0 to 30688
Data columns (total 19 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id                    30689 non-null  object
 1   title                 30689 non-null  object
 2   type                  30689 non-null  object
 3   description           30686 non-null  object
 4   release_year          30689 non-null  int64
 5   age_certification     27498 non-null  object
 6   runtime               30689 non-null  int64
 7   genres                30689 non-null  object
 8   production_countries  30689 non-null  object
 9   seasons               2379 non-null   float64
 10  imdb_id               26878 non-null  object
 11  imdb_score            26712 non-null  float64
 12  imdb_votes            26581 non-null  float64
 13  tmdb_popularity       30689 non-null  float64
 14  tmdb_score            30407 non-null  float64
 15  person_id             30689 non-null  int64
 16  name                  30689 non-null  object
 17  character             28794 non-null  object
 18  role                  30689 non-null  object
dtypes: float64(5), int64(3), object(11)
memory usage: 4.7+ MB

In [402]:
df.shape

(30689, 19)

In [403]:
#df.drop_duplicates(subset="title", keep="first", inplace=True)

In [404]:
#df.info()

In [405]:
df.shape

(30689, 19)

In [406]:
df.isnull().sum()

id                          0
title                       0
type                        0
description                 3
release_year                0
age_certification        3191
runtime                     0
genres                      0
production_countries        0
seasons                 28310
imdb_id                  3811
imdb_score               3977
imdb_votes               4108
tmdb_popularity             0
tmdb_score                282
person_id                   0
name                        0
character                1895
role                        0
dtype: int64

In [407]:
df["id"].value_counts(dropna=False)

tm84668      245
tm7          183
tm202481     176
tm3          175
tm145073     163
            ...
ts57135        1
ts272675       1
tm318925       1
tm348282       1
tm1227149      1
Name: id, Length: 1733, dtype: int64

In [408]:
df["title"].value_counts(dropna=False)

Enchanted                       245
Beauty and the Beast            189
Star Wars: The Force Awakens    183
Rogue One: A Star Wars Story    176
Return of the Jedi              175
                               ...
Wild Yellowstone                  1
Behind the Attraction             1
Mega Hammerhead                   1
Expedition Mars                   1
Baby Sharks                       1
Name: title, Length: 1695, dtype: int64

In [409]:
df["type"].value_counts(dropna=False)

MOVIE    28310
SHOW      2379
Name: type, dtype: int64

In [410]:
df["description"].value_counts(dropna=False)

The beautiful princess Giselle is banished by an evil queen from her magical, musical animated land and finds herself in the gritty reality of the streets of modern-day Manhattan. Shocked by this strange new environment that doesn't operate on a "happily ever after" basis, Giselle is now adrift in a chaotic world badly in need of enchantment. But when Giselle begins to fall in love with a charmingly flawed divorce lawyer who has come to her aid - even though she is already promised to a perfect fairy tale prince back home - she has to wonder: Can a storybook view of romance survive in the real world?                                                    245
Thirty years after defeating the Galactic Empire, Han Solo and his allies face a new threat from the evil Kylo Ren and his army of Stormtroopers.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  183
A rogue band of resistance fighters unite for a mission to steal the Death Star plans and bring a new hope to the galaxy.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          176
Luke Skywalker leads a mission to rescue his friend Han Solo from the clutches of Jabba the Hutt, while the Emperor seeks to destroy the Rebellion once and for all with a second dreaded Death Star.                                                                                                                                                                                                                                                                                                                                                                                                                                                                              175
By the mid-1980s, the fabled animation studios of Walt Disney had fallen on hard times. The artists were polarized between newcomers hungry to innovate and old timers not yet ready to relinquish control. These conditions produced a series of box-office flops and pessimistic forecasts: maybe the best days of animation were over. Maybe the public didn't care. Only a miracle or a magic spell could produce a happy ending. Waking Sleeping Beauty is no fairy tale. It's the true story of how Disney regained its magic with a staggering output of hits - "Little Mermaid," "Beauty and the Beast ," "Aladdin," "The Lion King," and more - over a 10-year period.    163
                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                  ...
One famous day. Five heroes. Five key turning points that changed the course of World War Two during the D Day landings, told through the eyes of the people who made a difference. Using rarely seen archive, dramatic reconstruction and written accounts from eye witnesses and personal testimony from our five heroes, this is D Day as never seen before.                                                                                                                                                                                                                                                                                                                      1
Using the very latest in drone and aerial photographic technology, tour across countries and their seasons, getting a unique view from above.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                        1
An animated short based on Hans Christian Andersen's tale about a poor young girl with a burning desire to find comfort and happiness in her life. Desperate to keep warm, the girl lights the matches she sells, and envisions a very different life for herself in the fiery flames filled with images of loving relatives, bountiful food, and a place to call home.                                                                                                                                                                                                                                                                                                              1
Documentary series in which Goldblum pulls back the curtain on a seemingly familiar object to reveal a world of astonishing connections, fascinating science, and a whole lot of big ideas.                                                                                                                                                                                                                                                                                                                                                                                                                                                                                          1
Even the biggest, fastest and fiercest predators start as babies. Baby sharks are cute, but they need to grow up fast because out of more than 500 species of sharks, not one parent sticks around to help raise them. Sharks are found in every ocean across the planet and have evolved in extraordinarily different ways to carry their young and give birth and for baby sharks to thrive.                                                                                                                                                                                                                                                                                       1
Name: description, Length: 1731, dtype: int64

In [411]:
df = df.dropna(axis=0, subset=["description"])

In [412]:
df["release_year"].value_counts(dropna=False)

2022    2087
2021    1504
2016    1347
2019    1345
2017    1316
        ...
1943      12
1954       7
1946       5
1928       2
1944       2
Name: release_year, Length: 93, dtype: int64

In [413]:
df["age_certification"].value_counts(dropna=False)

PG          11439
G            8530
PG-13        5240
NaN          3188
TV-G          452
TV-Y7         447
TV-PG         396
TV-14         387
TV-Y          291
R             228
TV-MA          59
TV-Y7-FV       29
Name: age_certification, dtype: int64

In [414]:
df["age_certification"] =  df["age_certification"].fillna("pad")

In [415]:
df["runtime"].value_counts(dropna=False)

88     946
100    767
93     755
105    710
102    683
      ...
59       9
57       8
36       7
13       6
182      1
Name: runtime, Length: 159, dtype: int64

In [416]:
df["genres"].value_counts(dropna=False)

['documentation']                                    1775
['comedy']                                           1066
['action', 'scifi', 'fantasy']                       1001
['scifi', 'action']                                   850
['comedy', 'family']                                  677
                                                     ...
['documentation', 'history', 'crime', 'european']       1
['reality', 'scifi', 'documentation']                   1
['action', 'documentation']                             1
['action', 'scifi', 'fantasy', 'animation']             1
['reality', 'documentation', 'action']                  1
Name: genres, Length: 700, dtype: int64

In [417]:
df["genres"] = df["genres"].apply(lambda x : x.strip("[', '"))



#df["genres"] = df["genres"].apply(lambda x : x.strip("["))
#df["genres"] = df["genres"].apply(lambda x : x.strip("' '"))

In [418]:
#df["genres"] = df["genres"].apply(lambda x : x.strip([0]))

In [419]:
df["genres"].value_counts(dropna=False)

documentation']                                    1775
comedy']                                           1066
action', 'scifi', 'fantasy']                       1001
scifi', 'action']                                   850
comedy', 'family']                                  677
                                                   ...
documentation', 'history', 'crime', 'european']       1
reality', 'scifi', 'documentation']                   1
action', 'documentation']                             1
action', 'scifi', 'fantasy', 'animation']             1
reality', 'documentation', 'action']                  1
Name: genres, Length: 700, dtype: int64

In [420]:
df["genres"] = df["genres"].apply(lambda x : x.strip("[1]"))

In [421]:
df["genres"] = df["genres"].apply(lambda x : x.strip("[2]"))

In [422]:
df["genres"] = df["genres"].apply(lambda x : x.strip("[3]"))

In [423]:
df["genres"].value_counts(dropna=False)

documentation'                                    1775
comedy'                                           1066
action', 'scifi', 'fantasy'                       1001
scifi', 'action'                                   850
comedy', 'family'                                  677
                                                  ...
documentation', 'history', 'crime', 'european'       1
reality', 'scifi', 'documentation'                   1
action', 'documentation'                             1
action', 'scifi', 'fantasy', 'animation'             1
reality', 'documentation', 'action'                  1
Name: genres, Length: 700, dtype: int64

In [424]:
df["production_countries"].value_counts(dropna=False)

['US']          26038
['US', 'CA']      627
['US', 'GB']      577
['GB', 'US']      547
['CA', 'US']      507
                ...
['US', 'GT']        1
['AE']              1
['AT']              1
['ZA']              1
['NZ']              1
Name: production_countries, Length: 84, dtype: int64

In [425]:
df["production_countries"] = df["production_countries"].apply(lambda x : x.strip("[', ']"))

In [426]:
df["production_countries"].value_counts(dropna=False)

US          26038
US', 'CA      627
US', 'GB      577
GB', 'US      547
CA', 'US      507
            ...
US', 'GT        1
AE              1
AT              1
ZA              1
NZ              1
Name: production_countries, Length: 84, dtype: int64

In [427]:
df["seasons"].value_counts(dropna=False)

NaN     28308
1.0       827
2.0       564
3.0       506
4.0       180
5.0       102
6.0        70
7.0        46
8.0        46
36.0        6
32.0        6
20.0        6
9.0         6
10.0        5
14.0        4
22.0        2
34.0        1
12.0        1
Name: seasons, dtype: int64

In [428]:
df = df.dropna(axis=0, subset=['seasons'])

In [429]:
df["imdb_id"].value_counts(dropna=False)

NaN           92
tt5189554     29
tt11950984    27
tt0088515     26
tt1626038     24
              ..
tt12162902     1
tt12362380     1
tt9165706      1
tt11097576     1
tt15257974     1
Name: imdb_id, Length: 421, dtype: int64

In [430]:
df = df.dropna(axis=0, subset=['imdb_id'])

In [431]:
df["imdb_score"].value_counts(dropna=False)

6.3    128
6.5    126
8.3     94
6.6     93
6.8     93
7.4     86
6.0     85
6.7     82
7.5     77
8.4     71
7.6     71
6.9     70
8.0     68
6.4     66
7.9     62
8.2     62
7.0     60
7.3     58
7.1     58
5.6     56
7.7     54
5.2     50
5.8     47
6.1     46
8.1     46
7.8     44
6.2     34
7.2     32
5.5     32
5.3     30
5.9     27
9.0     27
5.1     26
5.7     26
4.6     24
4.9     19
4.8     19
8.5     17
8.6     14
8.8     11
NaN     11
5.4     10
8.7     10
3.9      9
4.0      8
2.8      7
3.2      6
3.8      6
4.2      5
4.1      5
4.5      5
5.0      5
9.5      2
4.4      2
3.4      2
4.3      1
9.3      1
Name: imdb_score, dtype: int64

In [432]:
df = df.dropna(axis=0, subset=['imdb_score'])

In [433]:
df["imdb_votes"].value_counts(dropna=False)

1538.0     29
24054.0    27
2066.0     26
15398.0    24
3593.0     22
           ..
446.0       1
52.0        1
426.0       1
272.0       1
58.0        1
Name: imdb_votes, Length: 373, dtype: int64

In [434]:
df = df.dropna(axis=0, subset=['imdb_votes'])

In [435]:
df["imdb_votes"].value_counts(dropna=False)

1538.0     29
24054.0    27
2066.0     26
15398.0    24
3593.0     22
           ..
446.0       1
52.0        1
426.0       1
272.0       1
58.0        1
Name: imdb_votes, Length: 373, dtype: int64

In [436]:
df["tmdb_popularity"].value_counts(dropna=False)

159.736    29
11.192     27
9.327      26
66.274     24
21.875     23
           ..
1.849       1
15.797      1
5.859       1
1.575       1
3.733       1
Name: tmdb_popularity, Length: 399, dtype: int64

In [437]:
df["tmdb_score"].value_counts(dropna=False)

6.900    72
7.400    69
7.300    69
7.000    68
7.800    63
         ..
8.262     1
3.000     1
7.303     1
9.300     1
8.599     1
Name: tmdb_score, Length: 183, dtype: int64

In [438]:
df["person_id"].value_counts(dropna=False)

528        13
18723      10
5470       10
19829       9
50245       8
           ..
598240      1
1079587     1
856372      1
1622608     1
1803879     1
Name: person_id, Length: 1888, dtype: int64

In [439]:
df["name"].value_counts(dropna=False)

Jim Cummings         13
Dee Bradley Baker    10
Bill Farmer          10
Corey Burton          9
Tony Anselmo          8
                     ..
Berlin Gross          1
Katlyn Nichol         1
Peter MacKenzie       1
Jeff Meacham          1
Pyper Braun           1
Name: name, Length: 1885, dtype: int64

In [440]:
df["character"].value_counts(dropna=False)

NaN                       231
Self                       73
Narrator                   29
Self (archive footage)     27
Himself                    21
                         ...
Captain Hook (voice)        1
Mr. Smee (voice)            1
Skully (voice)              1
Maxi                        1
Bitsy (voice)               1
Name: character, Length: 1690, dtype: int64

In [441]:
df = df.dropna(axis=0, subset=['character'])

In [442]:
df["role"].value_counts(dropna=False)

ACTOR    2044
Name: role, dtype: int64

In [443]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 2044 entries, 865 to 30685
Data columns (total 19 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   id                    2044 non-null   object
 1   title                 2044 non-null   object
 2   type                  2044 non-null   object
 3   description           2044 non-null   object
 4   release_year          2044 non-null   int64
 5   age_certification     2044 non-null   object
 6   runtime               2044 non-null   int64
 7   genres                2044 non-null   object
 8   production_countries  2044 non-null   object
 9   seasons               2044 non-null   float64
 10  imdb_id               2044 non-null   object
 11  imdb_score            2044 non-null   float64
 12  imdb_votes            2044 non-null   float64
 13  tmdb_popularity       2044 non-null   float64
 14  tmdb_score            2008 non-null   float64
 15  person_id             2044 non-null   int64
 16  name                  2044 non-null   object
 17  character             2044 non-null   object
 18  role                  2044 non-null   object
dtypes: float64(5), int64(3), object(11)
memory usage: 319.4+ KB